In [2]:
import pandas as pd

In [6]:
df_list = pd.read_csv("A회사_보습제_매출데이터_V1.csv", encoding="cp949")

In [13]:
df_list.head()
#매출데이터 월별 표시

,Unnamed: 0,Sep,Oct,Nov,Dec,Jan,Feb
0,총매출,"$5,280,000","$5,501,000","$5,469,000","$5,480,000","$5,533,000","$5,554,000"
1,목표매출,"$5,280,000","$5,500,000","$5,729,000","$5,968,000","$6,217,000","$6,476,000"
2,광고비용,"$1,056,000","$950,400","$739,200","$528,000","$316,800","$316,800"
3,소셜네트워크비용,$0,"$105,600","$316,800","$528,000","$739,200","$739,200"
4,1온스별단가,$2.00,$2.00,$2.00,$1.90,$1.90,$1.90

In [8]:
df_list.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  5 non-null      object
 1   Sep         5 non-null      object
 2   Oct         5 non-null      object
 3   Nov         5 non-null      object
 4   Dec         5 non-null      object
 5   Jan         5 non-null      object
 6   Feb         5 non-null      object
dtypes: object(7)
memory usage: 408.0+ bytes

In [10]:
df_list.head()
#매출 데이터 월별 표시

,Unnamed: 0,Sep,Oct,Nov,Dec,Jan,Feb
0,총매출,"$5,280,000","$5,501,000","$5,469,000","$5,480,000","$5,533,000","$5,554,000"
1,목표매출,"$5,280,000","$5,500,000","$5,729,000","$5,968,000","$6,217,000","$6,476,000"
2,광고비용,"$1,056,000","$950,400","$739,200","$528,000","$316,800","$316,800"
3,소셜네트워크비용,$0,"$105,600","$316,800","$528,000","$739,200","$739,200"
4,1온스별단가,$2.00,$2.00,$2.00,$1.90,$1.90,$1.90

In [12]:
df_list['Sep'].sum()

'$5,280,000 $5,280,000 $1,056,000 $0 $2.00 '